/*
💫 Instance


프로그래밍에서는 어떤 데이터 구조나 
객체가 특정 구조나 형식의 "구체적 실체"로 만들어질 때 인스턴스라고 불립니다.



1. 클래스와 인스턴스
가장 흔한 용례로, 클래스에서 구체적인 객체를 생성할 때 "인스턴스"라고 부릅니다.



2. 데이터베이스 
데이터베이스에서도 특정 테이블의 행(row)을 테이블 구조의 인스턴스라고 말하기도 해요. 
예를 들어, 사용자 테이블에서 하나의 사용자 레코드(행)는 사용자 구조의 인스턴스입니다.






3. 일반 객체
JavaScript에서는 클래스 없이도 객체를 만들 수 있죠. 
이 객체도 특정 "형식"을 기반으로 만들어진 인스턴스로 간주할 수 있어요.

예시:
const car = {
  
};
여기서 car는 객체의 인스턴스라고 할 수 있어요. 
특정 형식에 맞춰 만들어진 구체적인 실체이기 때문이에요.


예시2:
const car = new Object();
car.make = "Toyota";
car.model = "Corolla";

car는 Object 클래스의 인스턴스입니다.
new Object()는 Object 클래스의 인스턴스를 생성하는 방법이죠.




*/